# データセット
CATEGORIES = (
    ('0', 'AED設置箇所一覧'),
    ('1', '介護サービス事業所一覧'),
    ('2', '医療機器一覧'),
    ('3', '文化財一覧'),
    ('4', '観光施設一覧'),
    ('5', 'イベント一覧'),
    ('6', '公共無線LANアクセスポイント一覧'),
    ('7', '公衆トイレ一覧'),
    ('8', '消防水利施設一覧'),
    ('9', '指定緊急避難場所一覧'),
    ('10', '地域・年齢別人口'),
    ('11', '公共施設一覧'),
    ('12', '子育て施設一覧'),
)

# AED設置箇所一覧
AED = (
    ('都道府県コード又は市区町村コード', '都道府県コード又は市区町村コード'),
    ('NO', 'NO'),
    ('都道府県名', '都道府県名'),
    ('市区町村名', '市区町村名'),
    ('名称', '名称'),
    ('名称_カナ', '名称_カナ'),
    ('住所', '住所'),
    ('方書', '方書'),
    ('緯度', '緯度'),
    ('経度', '経度'),
    ('設置位置', '設置位置'),
    ('電話番号', '電話番号'),
    ('内線番号', '内線番号'),
    ('法人番号', '法人番号'),
    ('団体名', '団体名'),
    ('利用可能曜日', '利用可能曜日'),
    ('開始時間', '開始時間'),
    ('終了時間', '終了時間'),
    ('利用可能日時特記事項', '利用可能日時特記事項'),
    ('小児対応設備の有無', '小児対応設備の有無'),
    ('URL', 'URL'),
    ('備考', '備考'),
)

# 介護サービス事業所一覧
CARE_SERVICE = (
    ('都道府県コード又は市区町村コード', '都道府県コード又は市区町村コード'),
    ('NO', 'NO'),
    ('都道府県名', '都道府県名'),
    ('市区町村名', '市区町村名'),
    ('介護サービス事業所名称', '介護サービス事業所名称'),
    ('介護サービス事業所名称_カナ', '介護サービス事業所名称_カナ'),
    ('実施サービス', '実施サービス'),
    ('住所', '住所'),
    ('方書', '方書'),
    ('緯度', '緯度'),
    ('経度', '経度'),
    ('電話番号', '電話番号'),
    ('内線番号', '内線番号'),
    ('FAX番号', 'FAX番号'),
    ('法人番号', '法人番号'),
    ('法人の名称', '法人の名称'),
    ('事業所番号', '事業所番号'),
    ('利用可能曜日', '利用可能曜日'),
    ('開始時間', '開始時間'),
    ('終了時間', '終了時間'),
    ('利用可能曜日特記事項', '利用可能曜日特記事項'),
    ('定員', '定員'),
    ('URL', 'URL'),
    ('備考', '備考'),
)

# 医療機器一覧

# 文化財一覧

# 観光施設一覧

# イベント一覧

# 公共無線LANアクセスポイント一覧

# 公衆トイレ一覧

# 消防水利施設一覧

# 指定緊急避難場所一覧

# 地域・年齢別人口

# 公共施設一覧

# 子育て施設一覧
